---
kind: method
id: M:Autodesk.Revit.UI.IExternalEventHandler.Execute(Autodesk.Revit.UI.UIApplication)
source: html/4cc5c307-ea8c-7135-7e73-90e3640ccaf7.htm
---
# Autodesk.Revit.UI.IExternalEventHandler.Execute Method

This method is called to handle the external event.

## Syntax (C#)
```csharp
void Execute(
	UIApplication app
)
```

## Parameters
- **app** (`Autodesk.Revit.UI.UIApplication`)